{
  "Genre": "Jazz",
  "Description": "Originating in African American communities in the Southern United States around the turn of the 20th century, building on New Orleans Brass Band ensemble and influences from Ragtime and Blues to become a very popular style by the emergence of Swing in the 1930s.",
  "Subgenres": {
    "Afro-Jazz": {
      "Description": "African-styled percussion and rhythms."
    },
    "Arabic Jazz": {
      "Description": "Blending of Arabic Music and Jazz."
    },
    "Avant-Garde Jazz": {
      "Description": "Combines traditional or mainstream Jazz stylings with non-traditional techniques of avant-garde art music by experimenting with characteristics such as rhythm, harmony, structure, melody, and instrumentation.",
      "Subgenres": {
        "Experimental Big Band": {
          "Description": "Dispensing with traditional Jazz structures and Swing sounds, instead performing Avant-Garde Jazz and pushing the boundaries of the medium.",
          "Subgenres": {
            "Free Jazz": {
              "Description": "Attempts to break free from the conventions and patterns of earlier Jazz subgenres through the use of elements such as dissonance, atonality, and free-flowing rhythmic structures.",
              "Subgenres": {
                "European Free Jazz": {
                  "Description": "Arose in Europe in the late 1960s and early 1970s, moving even further from the Jazz tradition by often dropping the swinging rhythm, taking liberties with the use of atonality and noise."
                }
              }
            }
          }
        },
        "Yass": {
          "Description": "Coined in the early 1990s by a group of Polish Avant-Garde Jazz musicians to describe their cross-genre, often arrhythmic, improvised sound."
        }
      }
    },
    "Bebop": {
      "Description": "Fast tempos, improvisation, irregular melodic phrasing, and complex harmonies and chord structures."
    },
    "Big Band": {
      "Description": "Commonly associated with the golden era of Swing in the 1930s and 1940s, performed by a large ensemble including brass, woodwinds, and usually a rhythm section.",
      "Subgenres": {
        "Progressive Big Band": {
          "Description": "Introduces Western Classical Music compositional techniques into Big Band."
        }
      }
    },
    "British Dance Band": {
      "Description": "Came from the dancehalls of the 1920s and 1930s, combining a British take on Jazz with the Music Hall tradition."
    },
    "Bulawayo Jazz": {
      "Description": "Emerged from the city of Bulawayo, Zimbabwe in the early 1950s, led by the alto sax and accompanied by ensembles."
    },
    "Cape Jazz": {
      "Description": "Developed parallel to American Jazz in the early 20th century, named for its origin in Cape Town, South Africa."
    },
    "Cartoon Music": {
      "Description": "Zany and uptempo; incorporated elements of Western Classical Music and Modern Classical into frantic Big Band arrangements, playfully chaotic to match the on-screen actions of cartoon characters and the beat of their movements."
    },
    "Chamber Jazz": {
      "Description": "Made by mostly small acoustic-based ensembles with emphasized improvisation and influenced by Neoclassicism and Traditional Folk Music."
    },
    "Cool Jazz": {
      "Description": "Developed in the late 1940s alongside and in response to Bebop, featuring a more restrained, emotionally 'cool' style."
    },
    "Crime Jazz": {
      "Description": "Gritty, moody style that emerged in the mid-1950s to accompany film noir movies and hard-boiled detective/crime-themed TV shows."
    },
    "Dark Jazz": {
      "Description": "Melancholic and gloomy Film noir-inspired atmosphere and influence from Crime Jazz and Dark Ambient."
    },
    "Dixieland": {
      "Description": "Developed in New Orleans in the 1910s, incorporating influences from Ragtime and Blues into cacophonous, polyphonic arrangements with instruments trading places between accompaniment and soloist."
    },
    "ECM Style Jazz": {
      "Description": "Primarily associated with ECM Records, combining elements of Jazz Fusion with the subdued atmosphere of Cool Jazz and the Western Classical Music bent of Third Stream."
    },
    "Ethio-Jazz": {
      "Description": "Unique blend of traditional Ethiopic Music and Jazz."
    },
    "Flamenco Jazz": {
      "Description": "Combination of Jazz with Flamenco nuevo, the contemporary style of Flamenco, which was pioneered in the late 1960s."
    },
    "Hard Bop": {
      "Description": "A continuation of Bebop that reintroduces more traditional African-American musical features, such as bluesy melodies, slow to medium tempos, and a more groove-oriented sound, while retaining the expressive improvisation."
    },
    "Indo Jazz": {
      "Description": "Fuses the various musical traditions of the Indian subcontinent with jazzy musical structures."
    },
    "Jazz-Funk": {
      "Description": "Jazz highly influenced by Funk."
    },
    "Jazz Fusion": {
      "Description": "Near-universal usage of electric guitars and keyboards coupled with influences from genres such as Rock, Rhythm & Blues, Funk, and Traditional Folk Music, and a relative degree of harmonic simplicity."
    },
    "Jazz manouche": {
      "Description": "Combines Jazz with several aspects of Romani Folk Music."
    },
    "Jazz Poetry": {
      "Description": "Emerged in the 1920s, incorporating the style and rhythms of Jazz as both art forms spread throughout African-American communities in the United States."
    },
    "Kréyol djaz": {
      "Description": "Combines Jazz with various styles of French Caribbean Music."
    },
    "Latin Jazz": {
      "Description": "Used originally for Afro-Cuban Jazz but, due to its evolution, is now used for the fusion of jazz with Latin American rhythms, especially genres with African origin.",
      "Subgenres": {
        "Afro-Cuban Jazz": {
          "Description": "Combines Jazz with the rhythm of Afro-Cuban music like Habanera."
        }
      }
    },
    "Marabi": {
      "Description": "South African Jazz with origins in the 1920s and rooted in traditional South African music.",
      "Subgenres": {
        "Kwela": {
          "Description": "Influenced by Zulu music, characterized by its happy melodies, played by pennywhistle flutes and accompanied by a banjo or a guitar."
        },
        "Mbaqanga": {
          "Description": "Emerged from the traditional Marabi Jazz and Swing as well as Kwela popular South African genres."
        }
      }
    },
    "Modal Jazz": {
      "Description": "Utilizes musical modes as harmonic framework over traditionally used chord progressions.",
      "Subgenres": {
        "Jazz Mugham": {
          "Description": "Combines Jazz with elements of Azerbaijani Mugham, featuring jazz-inspired instrumental compositions, improvisations, wind and vocal elements, as well as modal scales and ornamentation techniques for emotional depth."
        }
      }
    },
    "Post-Bop": {
      "Description": "Grew out of Hard Bop in the early to mid-1960s incorporating certain untraditional elements inspired largely in part from Avant-Garde Jazz, Modal Jazz and eventually, Free Jazz, such as non-diatonic chord progressions, irregular rhythms and amelodic forms."
    },
    "Samba-jazz": {
      "Description": "Jazz genre from Brazil that incorporates Samba and/or Bossa nova elements."
    },
    "Smooth Jazz": {
      "Description": "Simple melodies and slick production influenced by Pop and R&B."
    },
    "Soul Jazz": {
      "Description": "Appeared during the 1950s, when Gospel, Rhythm & Blues and later Soul started to influence the style of prolific jazz musicians."
    },
    "Spiritual Jazz": {
      "Description": "Emerged in the 1960s, marked by a mixture of Jazz with approximations of ethnic styles, religious music of non-Christian traditions, and the ecstatic, transcendental aspects of Free Jazz."
    },
    "Spy Music": {
      "Description": "Meant to evoke the action and drama of spy films."
    },
    "Stride": {
      "Description": "Early form of Ragtime-derived Jazz with improvisational tendencies; named for the performers' left hand 'striding' across the piano keyboard."
    },
    "Swing": {
      "Description": "Distinctive rhythm and large backing rhythm section over which solos are performed.",
      "Subgenres": {
        "Swing Revival": {
          "Description": "1990s alternative take on swing music, incorporating elements from newer genres such as Rockabilly, Ska, and Punk Rock."
        }
      }
    },
    "Third Stream": {
      "Description": "A fusion of Jazz and Western Classical Music, with improvisation as a vital component."
    },
    "Vocal Jazz": {
      "Description": "Focused on vocals, generally using a more traditional, poppy strong structure and reducing the role of improvisation.",
      "Subgenres": {
        "Vocalese": {
          "Description": "Newly written lyrics set to the melody of an existing instrumental solo, often in a Bebop or Big Band style, and characterized by syllabic phrasing."
        }
      }
    }
  }
}
